In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\zish0\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\zish0\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\zish0\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\zish0\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\zish0\anaconda3\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in c:\users\zish0\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd
import numpy as np

In [16]:
data = [[1],[2,3,5],"Zeshan"]
index = [1,2,3]
pds = pd.Series(data, index=index)

In [17]:
pds

1          [1]
2    [2, 3, 5]
3       Zeshan
dtype: object

In [19]:
for i in pds:
    print(i)

[1]
[2, 3, 5]
Zeshan

In [20]:
s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])

In [21]:
s

a   -0.922580
b    1.365089
c   -0.140211
d    1.552873
e    0.308333
dtype: float64

In [22]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [23]:
d = {"b": 1, "a": 0, "c": 2}

In [24]:
pds = pd.Series(d)

In [25]:
pds

b    1
a    0
c    2
dtype: int64

In [26]:
s = pd.Series(np.random.randn(5), name="something")

In [27]:
s

0   -0.614681
1    0.184554
2   -0.239133
3   -0.092851
4    1.191375
Name: something, dtype: float64

In [35]:
d = {
    "one": pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]),
    "two": pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"]),
     "three":pds
}

In [36]:
print(d)

{'one': a    1.0
b    2.0
c    3.0
dtype: float64, 'two': a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64, 'three': b    1
a    0
c    2
dtype: int64}

In [37]:
df = pd.DataFrame(d)

In [38]:
df

   one  two  three
a  1.0  1.0    0.0
b  2.0  2.0    1.0
c  3.0  3.0    2.0
d  NaN  4.0    NaN

In [41]:
df.to_csv("data.csv",index=False)

In [44]:
df.describe()

       one       two  three
count  3.0  4.000000    3.0
mean   2.0  2.500000    1.0
std    1.0  1.290994    1.0
min    1.0  1.000000    0.0
25%    1.5  1.750000    0.5
50%    2.0  2.500000    1.0
75%    2.5  3.250000    1.5
max    3.0  4.000000    2.0

In [45]:
df.isna().sum()

one      1
two      0
three    1
dtype: int64

In [52]:
titanic = pd.read_csv("tested.csv")

In [55]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [59]:
titanic[titanic["Name"] == "Kelly, Mr. James"]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q

In [62]:
agegreater_30=titanic[titanic["Age"] > 30]

In [63]:
agegreater_30.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
11,903,0,1,"Jones, Mr. Charles Cresson",male,46.0,0,0,694,26.0000,NaN,S
13,905,0,2,"Howard, Mr. Benjamin",male,63.0,1,0,24065,26.0000,NaN,S

In [67]:
un_surv = titanic [ titanic["Survived"]== 0]

In [68]:
un_surv.shape

(266, 12)

In [69]:
surv = titanic[titanic["Survived"]==1]

In [70]:
surv

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
6,898,1,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
8,900,1,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
12,904,1,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.0,1,0,21228,82.2667,B45,S
...,...,...,...,...,...,...,...,...,...,...,...,...
409,1301,1,3,"Peacock, Miss. Treasteall",female,3.0,1,1,SOTON/O.Q. 3101315,13.7750,NaN,S
410,1302,1,3,"Naughton, Miss. Hannah",female,NaN,0,0,365237,7.7500,NaN,Q
411,1303,1,1,"Minahan, Mrs. William Edward (Lillian E Thorpe)",female,37.0,1,0,19928,90.0000,C78,Q
412,1304,1,3,"Henriksson, Miss. Jenny Lovisa",female,28.0,0,0,347086,7.7750,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C